docs: actualizacion de la documentacion de la tarea2
